; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 962515 2 3 2 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	image0 - mode
	Star1 - direction
	Star4 - direction
	Star6 - direction
	Star5 - direction
	Star3 - direction
	Star0 - direction
	GroundStation2 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star5)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star8 spectrograph1)
	(have_image Planet9 image0)
	(have_image Star10 spectrograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (turn_to satellite0 star8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star8)
   goals met: 0 of 4
4. (turn_to satellite1 star7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star7)
   goals met: 0 of 4
5. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 1 of 4
6. (calibrate satellite1 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 1 of 4
7. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 1 of 4
8. (turn_to satellite0 star10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star10)
   goals met: 0 of 4
9. (take_image satellite1 star8 instrument2 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 1 of 4
10. (turn_to satellite0 star4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star4)
   goals met: 2 of 4
11. (turn_to satellite1 star10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star10)
   goals met: 2 of 4
12. (take_image satellite1 star10 instrument2 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 3 of 4
13. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 3 of 4
14. (take_image satellite1 planet9 instrument2 image0)
   added: (have_image planet9 image0)
   goals met: 4 of 4
